{
    "topics": [
        {
            "id": "1",
            "title": "Introducción a las arquitecturas móviles",
            "description": "Fundamentos esenciales, definiciones y objetivos críticos para el desarrollo de software móvil moderno.",
            "subtopics": [
                {
                    "title": "1.1 Arquitectura de software en aplicaciones móviles",
                    "content": "\n<div class=\"definition-box\" style=\"background: rgba(0,0,255,0.05); padding: 1.5rem; border-left: 5px solid var(--accent-blue); margin-bottom: 2rem; border-radius: 4px;\">\n    <h4 style=\"color: var(--accent-blue); margin-bottom: 0.5rem;\">Definición Formal</h4>\n    <p>La arquitectura de software en aplicaciones móviles se define como la <strong>estructura organizativa fundamental</strong> de un sistema de software. No se trata solo de escribir código, sino de tomar decisiones de diseño críticas sobre los componentes principales, sus responsabilidades, las relaciones entre ellos y cómo interactúan con el sistema operativo (Android/iOS) y servicios externos.</p>\n</div>\n<p>Esencialmente, es el \"esqueleto\" que sostiene la aplicación. Una buena arquitectura es un conjunto de <strong>patrones, principios y técnicas estructurales</strong> que guían el desarrollo, asegurando que la aplicación sea:</p>\n<ul style=\"margin-left: 20px; color: #ccc; margin-bottom: 1rem;\">\n    <li><strong>Robusta:</strong> Capaz de manejar errores y condiciones inesperadas sin colapsar ante el usuario.</li>\n    <li><strong>Flexible:</strong> Adaptable a nuevos requisitos del mercado sin necesidad de reescribir todo el código base.</li>\n    <li><strong>Eficiente:</strong> Optimizada para el consumo de batería, memoria y datos móviles, recursos que son críticos y limitados en dispositivos móviles.</li>\n</ul>\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/CleanArchitecture.jpg\" alt=\"Clean Architecture Diagram\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n    <p style=\"font-size: 0.9rem; color: #888; margin-top: 0.5rem;\">Representación visual de capas en una arquitectura robusta (Clean Architecture).</p>\n</div>\n<h4 style=\"margin-top: 2rem; color: var(--accent-purple);\">Importancia Estratégica</h4>\n<p>En el competitivo mercado actual, una aplicación sin arquitectura es una bomba de tiempo. A medida que crece, se vuelve imposible de mantener (fenómeno conocido como \"Spaghetti Code\"), lo que lleva a bugs frecuentes, desinstalaciones por parte de los usuarios y costos de desarrollo insostenibles. Una arquitectura sólida es la diferencia entre un producto exitoso a largo plazo y uno que fracasa tras la primera versión.</p>"
                },
                {
                    "title": "1.2 Objetivos de una arquitectura móvil",
                    "content": "\n<p>Los objetivos de una arquitectura móvil van más allá de la simple organización; buscan garantizar la longevidad y calidad del producto a través de principios sólidos de ingeniería de software:</p>\n<div class=\"objectives-grid\" style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1.5rem; margin-top: 2rem;\">\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #00c6ff;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Organización y Modularidad</h4>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">Descomponer el sistema en módulos independientes permite que múltiples desarrolladores trabajen en paralelo sin bloquearse mutuamente. Facilita la reutilización de código en diferentes partes de la app y reduce la duplicación.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #0072ff;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\">️ Mantenibilidad y Testabilidad</h4>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">El código debe ser fácil de leer y probar. Una buena arquitectura permite escribir tests unitarios automatizados que garantizan que los cambios no rompan funcionalidades existentes, reduciendo drásticamente la necesidad de QA manual repetitivo.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #9d50bb;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Escalabilidad</h4>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">La capacidad de agregar nuevas características (features) de forma constante sin que la complejidad del código crezca exponencialmente. Permite a la app crecer de 10 a 100 pantallas de manera ordenada y predecible.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #6e48aa;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Separación de Responsabilidades (SoC)</h4>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">Cada componente debe tener una única razón para cambiar. La UI no debe saber de base de datos, y la lógica no debe saber de píxeles. Esto desacopla las dependencias y hace el sistema más robusto ante cambios.</p>\n    </div>\n</div>"
                }
            ]
        },
        {
            "id": "2",
            "title": "Arquitectura MVC (Model–View–Controller)",
            "description": "El patrón clásico y fundamental. Análisis profundo de sus componentes, flujo y viabilidad actual.",
            "subtopics": [
                {
                    "title": "2.1 Definición y Concepto",
                    "content": "\n<div class=\"definition-box\" style=\"background: rgba(0,0,255,0.05); padding: 1.5rem; border-left: 5px solid var(--accent-blue); margin-bottom: 2rem; border-radius: 4px;\">\n    <h4 style=\"color: var(--accent-blue); margin-bottom: 0.5rem;\">Definición de MVC</h4>\n    <p>MVC (Model-View-Controller) se define como una arquitectura o patrón de diseño que divide la aplicación en tres componentes principales interconectados: Modelo (Model), Vista (View) y Controlador (Controller), con el objetivo principal de separar la lógica de negocio y los datos de la interfaz de usuario, promoviendo una mejor organización, mantenimiento y escalabilidad del código.</p>\n</div>\n<p>Este patrón, originado en los años 70 para interfaces gráficas, es ampliamente utilizado en desarrollo móvil (como en Android con Activities como Controllers, o iOS con UIViewControllers), ya que facilita la separación de preocupaciones (separation of concerns), permitiendo que cambios en la UI no afecten la lógica de datos y viceversa.</p>\n<p>En apps móviles, MVC organiza el código en capas, donde el flujo típico es: el usuario interactúa con la View, que notifica al Controller; este actualiza el Model y refresca la View, asegurando eficiencia en entornos con recursos limitados como batería o memoria. Aunque no es estrictamente implementado en frameworks móviles modernos (que prefieren MVVM o MVP para mejor testabilidad), MVC sirve como base para apps simples, reduciendo complejidad y facilitando colaboración en equipos. En resumen, MVC es un patrón clásico que transforma el desarrollo de apps complejas en un proceso manejable, alineado con principios de modularidad y reutilización.</p>\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/MVC3.webp\" alt=\"MVC Design Pattern GeeksforGeeks\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n    <p style=\"font-size: 0.9rem; color: #888; margin-top: 0.5rem;\">Diagrama ilustrativo de MVC mostrando el flujo de interacción.</p>\n</div>"
                },
                {
                    "title": "2.2 Componentes Detallados",
                    "content": "\n<p>Los componentes de MVC se dividen en tres roles interconectados, cada uno con responsabilidades específicas para mantener la separación de preocupaciones en aplicaciones móviles. A continuación, se explica el rol de cada uno, con ejemplos en contextos como Android o iOS.</p>\n<div class=\"objectives-grid\" style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1.5rem; margin-top: 2rem;\">\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #00c6ff;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Modelo (Model)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Gestiona los datos y la lógica de negocio de la aplicación, representando entidades del mundo real (como usuarios o productos). Es responsable de almacenar, recuperar y manipular datos (desde bases de datos, APIs o redes), aplicar reglas de negocio, validar datos y mantener la integridad sin conocimiento de la UI. En apps móviles, el Model se actualiza independientemente, permitiendo pruebas unitarias fáciles y reutilización en diferentes vistas. Por ejemplo, en una app de e-commerce, el Model maneja el inventario y cálculos de precios, notificando al Controller de cambios.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #9d50bb;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\">️ Vista (View)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Se encarga de la interfaz de usuario, presentando los datos del Model de manera visual y manejando interacciones del usuario (como botones, listas o formularios). Es pasiva, enfocándose en la renderización y no en la lógica de datos; en móviles, incluye elementos como XML layouts en Android o Storyboards en iOS. La View observa cambios en el Model (vía Controller) para actualizarse automáticamente. Ejemplo: en una app de clima, la View muestra temperaturas y gráficos sin procesar los datos crudos.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #6e48aa;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Controlador (Controller)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Actúa como intermediario entre Model y View, procesando entradas del usuario (eventos como clics), actualizando el Model según sea necesario y refrescando la View con los datos actualizados. Contiene la lógica de aplicación principal, enrutando comandos y manejando el flujo. En móviles, como en Android Activities o iOS Controllers, puede volverse \"masivo\" en apps complejas si no se gestiona bien. Ejemplo: en una app de login, el Controller valida credenciales del Model y navega a la siguiente View.</p>\n    </div>\n</div>\n<p style=\"margin-top: 1.5rem; padding: 1rem; background: rgba(255,255,255,0.05); border-radius: 6px;\">Estos componentes interactúan unidireccionalmente: <strong>View → Controller → Model → Controller → View</strong>, asegurando flujo eficiente.</p>"
                },
                {
                    "title": "2.3 Flujo de Comunicación en MVC (Móvil)",
                    "content": "\n<h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\">Flujo de Comunicación en MVC</h4>\n<p>Este subtema describe cómo fluye la información entre el Modelo, la Vista y el Controlador en MVC, destacando la manera en que las acciones del usuario desencadenan cambios en el sistema. El flujo es unidireccional y cíclico, basado en el principio de separación de preocupaciones, donde el Controlador actúa como mediador para evitar acoplamientos directos entre Modelo y Vista, asegurando modularidad y facilidad de mantenimiento. En aplicaciones móviles, este flujo optimiza el manejo de eventos asíncronos (como toques en pantalla o actualizaciones de red), reduciendo el uso de batería y memoria al procesar solo cambios necesarios.</p>\n\n<p>El flujo típico de comunicación es el siguiente, paso a paso:</p>\n<ol style=\"margin-left: 1.5rem; color: #e0e0e0; margin-top: 1rem;\">\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Acción del usuario en la Vista:</strong> El usuario interactúa con la interfaz (por ejemplo, presiona un botón o envía un formulario), generando un evento o entrada que se envía al Controlador. Esto desencadena el proceso, como en una app de lista de tareas donde el usuario agrega un ítem.</li>\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Procesamiento en el Controlador:</strong> El Controlador recibe la entrada, la valida, aplica lógica de aplicación y decide si actualizar el Modelo (por ejemplo, guardando nuevos datos).</li>\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Actualización del Modelo:</strong> El Modelo procesa los cambios (por ejemplo, interactuando con una base de datos o API), actualiza sus datos y notifica al Controlador (o directamente a la Vista en variantes observadoras) de las modificaciones.</li>\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Refresco de la Vista:</strong> El Controlador recibe la notificación del Modelo, obtiene los datos actualizados y los envía a la Vista para que se actualice y muestre los cambios al usuario.</li>\n</ol>\n\n<p>Este flujo asegura que las actualizaciones sean reactivas y eficientes, con notificaciones basadas en eventos (como observers o callbacks) para manejar cambios asíncronos comunes en móviles. En resumen, las acciones del usuario inician un ciclo que propaga cambios de manera controlada, previniendo dependencias directas y facilitando depuración.</p>\n\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/mvc.jpg\" alt=\"Diagrama ilustrativo del flujo de comunicación en MVC\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n    <p style=\"font-size: 0.9rem; color: #888; margin-top: 0.5rem;\">Diagrama ilustrativo del flujo de comunicación en MVC</p>\n</div>"
                },
                {
                    "title": "2.4 Aplicación de MVC en Entornos Móviles",
                    "content": "\n<h4 style=\"color: var(--accent-blue); margin-bottom: 1rem;\">Aplicación de MVC en Entornos Móviles</h4>\n<p>Se analiza cómo se implementa MVC en aplicaciones móviles y las particularidades que presenta en plataformas como Android e iOS, donde algunos componentes pueden combinar responsabilidades para optimizar rendimiento en dispositivos con recursos limitados (como batería y memoria). MVC es ideal para apps simples o medianas, facilitando desarrollo rápido y navegación básica, pero en proyectos complejos puede llevar a \"controladores masivos\" (massive view controllers), donde el Controlador acumula lógica excesiva, reduciendo testabilidad. En móviles, se adapta a ciclos de vida de componentes (como Activities en Android o ViewControllers en iOS), manejando eventos como rotaciones de pantalla o terminaciones de app.</p>\n\n<h5 style=\"color: var(--accent-purple); margin-top: 1.5rem;\">Implementación en Android</h5>\n<p>En Android, MVC se implementa con Activities o Fragments como Controladores (manejan lógica y eventos), layouts XML como Vistas (UI pasiva), y clases POJO o bases de datos como Modelos (lógica de datos). Particularidades: Los Controladores (Activities) combinan responsabilidades de UI y lógica para eficiencia, pero esto puede inflar clases; se usa con adapters para listas. Recomendado para apps simples, aunque Google favorece MVVM para testabilidad. Ejemplo: En una app de chat, el Activity (Controller) actualiza un ListView (View) con datos de Firebase (Model).</p>\n\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <!-- Placeholder for Android MVC Diagram if available, reusing generic or description -->\n    <p style=\"font-size: 0.9rem; color: #888; margin-top: 0.5rem;\">Diagrama conceptual de MVC en Android</p>\n</div>\n\n<h5 style=\"color: var(--accent-purple); margin-top: 1.5rem;\">Implementación en iOS</h5>\n<p>En iOS, MVC es el patrón nativo promovido por Apple: UIViewController combina roles de Vista y Controlador (manejan UI y lógica), mientras que Modelos son clases separadas para datos. Particularidades: La combinación en UIViewController optimiza para interfaces táctiles, pero lleva a \"massive view controllers\"; se usa con UIKit o SwiftUI. Ideal para apps con lógica de negocio simple, extensible con patrones como delegates. Ejemplo: En una app de to-do, el UIViewController (Controller) actualiza una UITableView (View) con datos de un array (Model).</p>\n\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <!-- Placeholder for iOS MVC Diagram if available -->\n    <p style=\"font-size: 0.9rem; color: #888; margin-top: 0.5rem;\">Diagrama conceptual de MVC en iOS</p>\n</div>\n\n<p>En ambos plataformas, MVC facilita desarrollo inicial pero evoluciona a MVVM para apps complejas.</p>"
                },
                {
                    "title": "2.4.1 Caso de Estudio: Aranceles Globales (Web MVC)",
                    "content": "\n<p>Para ilustrar el patrón MVC en un entorno web moderno, utilizaremos un ejemplo visual sobre datos económicos: <strong>Aranceles Estadounidenses</strong>. Separaremos los datos (Modelo), la gráfica (Vista) y la lógica de control.</p>\n\n<div class=\"code-block\" style=\"background:#1e1e1e; padding:1rem; border-radius:8px; margin: 1rem 0; overflow-x:auto;\">\n<pre><code style=\"color:#ccc; font-family:monospace;\">\n// 1. MODELO (Datos)\nconst tariffData = {\n    countries: [\"China\", \"México\", \"Vietnam\", \"UE\"],\n    rates: [25, 5, 10, 8] // Porcentajes\n};\n\n// 2. VISTA (Interfaz - Chart.js)\nconst chartView = {\n    render: (data) => {\n        new Chart(document.getElementById(\"chart\"), {\n            type: \"bar\",\n            data: {\n                labels: data.countries,\n                datasets: [{ label: \"Arancel %\", data: data.rates }]\n            }\n        });\n    }\n};\n\n// 3. CONTROLADOR (Lógica)\nconst appController = {\n    init: () => {\n        // Pide datos al modelo y actualiza la vista\n        chartView.render(tariffData);\n    }\n};\n\nappController.init();\n</code></pre>\n</div>\n\n<div style=\"text-align: center; margin-top: 2rem;\">\n    <a href=\"examples/mvc_aranceles.html\" target=\"_blank\" class=\"cta-button\" style=\"text-decoration:none; display:inline-block; padding:10px 20px; background:#0072ff; color:white; border-radius:5px;\">Entrar al ejemplo</a>\n</div>\n"
                },
                {
                    "title": "2.5 Análisis de Costos y Evaluación",
                    "content": "\n<p>A continuación se presenta un análisis detallado de las ventajas y desventajas de implementar MVC en el contexto actual del desarrollo móvil.</p>\n<div class=\"table-responsive\" style=\"overflow-x: auto; margin-bottom: 2rem; border-radius: 8px; border: 1px solid #333;\">\n    <table style=\"width: 100%; border-collapse: collapse; min-width: 900px; font-size: 0.95rem;\">\n        <thead>\n            <tr style=\"background: linear-gradient(90deg, var(--accent-blue), var(--accent-purple)); color: white;\">\n                <th style=\"padding: 15px; text-align: left; width: 20%;\">Aspecto</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%; border-right: 1px solid rgba(255,255,255,0.2);\"> Ventaja (Por qué y Cuándo)</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%;\"> Desventaja (Por qué y Cuándo)</th>\n            </tr>\n        </thead>\n        <tbody>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Costo inicial y Curva de Aprendizaje</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Muy Bajo.</strong> Es el patrón más intuitivo y fácil de entender para desarrolladores junior. La separación mental (Datos vs UI) es natural. Ideal para equipos con poca experiencia.</td>\n                <td style=\"padding: 15px; color: #ccc;\">A medida que el equipo crece, la falta de reglas estrictas sobre dónde poner la lógica de presentación lleva a inconsistencias graves.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Tiempo de desarrollo</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Rápido.</strong> Perfecto para prototipos, MVPs (Producto Mínimo Viable) o Hackathons donde la velocidad de entrega es prioritaria sobre la calidad del código.</td>\n                <td style=\"padding: 15px; color: #ccc;\">El desarrollo se ralentiza exponencialmente en fases tardías debido a la deuda técnica acumulada y la dificultad para refactorizar \"God Classes\".</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Mantenimiento</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Aceptable en aplicaciones muy pequeñas con pocas pantallas y lógica simple.</td>\n                <td style=\"padding: 15px; color: #ccc;\"><strong>Pésimo en apps grandes.</strong> Surge el problema del \"Massive View Controller\", donde los controladores tienen miles de líneas de código, haciendo imposible su mantenimiento.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Testing (Pruebas)</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">El Modelo (Lógica de negocio pura) se puede probar unitariamente sin problemas.</td>\n                <td style=\"padding: 15px; color: #ccc;\"><strong>Muy Difícil.</strong> La lógica de UI está fuertemente acoplada al Controlador y a las librerías del sistema (Android SDK/UIKit), lo que impide realizar pruebas unitarias fáciles sin emuladores lentos.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Escalabilidad</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Limitada. Funciona bien hasta cierto punto de complejidad.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Baja. Al crecer la aplicación, el acoplamiento entre Vista y Controlador hace que añadir nuevas funcionalidades sea riesgoso y propenso a errores de regresión.</td>\n            </tr>\n        </tbody>\n    </table>\n</div>"
                }
            ]
        },
        {
            "id": "3",
            "title": "Arquitectura MVP (Model–View–Presenter)",
            "description": "La evolución orientada a la testabilidad. Desacoplamiento estricto mediante contratos e interfaces.",
            "subtopics": [
                {
                    "title": "3.1 Definición de MVP",
                    "content": "\n<div class=\"definition-box\" style=\"background: rgba(0,0,255,0.05); padding: 1.5rem; border-left: 5px solid var(--accent-blue); margin-bottom: 2rem; border-radius: 4px;\">\n    <h4 style=\"color: var(--accent-blue); margin-bottom: 0.5rem;\">3.1 Definición de MVP</h4>\n    <p>MVP (Model-View-Presenter) se define como una arquitectura que reemplaza el controlador por un presentador, el cual contiene la lógica de presentación y controla directamente la comunicación con la vista, separando estrictamente la interfaz de usuario de la lógica de negocio y datos para promover modularity, testabilidad y un código más limpio y mantenible. Este patrón, derivado de MVC en los años 90 por empresas como Taligent y popularizado en entornos como Microsoft y Android, surgió para abordar limitaciones de MVC, como el acoplamiento entre Vista y Modelo, al hacer la Vista pasiva y centralizar la lógica en un Presentador independiente del framework UI.</p>\n</div>\n<p>En aplicaciones móviles, MVP organiza el sistema en tres componentes interconectados: Modelo (datos y lógica de dominio, como interacciones con APIs o bases de datos), Vista (UI pasiva que solo renderiza y captura eventos), y Presentador (intermediario que procesa inputs, aplica reglas de presentación y actualiza la Vista vía interfaces o contratos, sin dependencias directas a componentes Android/iOS como Activities o UIViewControllers).</p>\n<p>Esta estructura facilita el manejo de desafíos móviles como ciclos de vida volátiles (ej. onDestroy en Android) y recursos limitados, permitiendo pruebas unitarias del Presentador sin emular UI, y mejorando la escalabilidad al evitar \"controladores masivos\" comunes en MVC. Aunque fue dominante en Android alrededor de 2015-2020 para apps con lógica compleja, en iOS es menos común debido al MVC nativo, pero se aplica en escenarios que requieren alta testabilidad; en 2026, ha evolucionado hacia MVVM con herramientas como Jetpack o SwiftUI para binding automático. En resumen, MVP es un patrón que prioriza la separación de preocupaciones mediante un Presentador como único puente, transformando el desarrollo de apps móviles en un proceso más robusto y eficiente comparado con patrones tradicionales.</p>\n\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/mvp.png\" alt=\"Diagrama ilustrativo de MVP\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n</div>"
                },
                {
                    "title": "3.2 Componentes de MVP",
                    "content": "\n<h4 style=\"color: var(--accent-blue); margin-bottom: 1rem;\">3.2 Arquitectura Interna y Comunicación en MVP</h4>\n<p>Se detallan las responsabilidades del modelo, la vista y el presentador, destacando que la vista actúa de forma pasiva y delega la lógica al presentador. Este subtema explica cómo la vista se comunica con el presentador mediante interfaces, y cómo el presentador actualiza la vista, mejorando la organización del código.</p>\n<p>La arquitectura interna de MVP se estructura en tres componentes desconectados físicamente pero interconectados lógicamente mediante interfaces o contratos, promoviendo un desacoplamiento estricto que facilita la inyección de dependencias (DI) y el principio de inversión de dependencias (DIP), alineado con SOLID para código robusto y extensible. En apps móviles, esta interna optimiza el manejo de estados asíncronos y ciclos de vida, reduciendo fugas de memoria al permitir que el Presentador se desacople de la Vista durante pausas.</p>\n\n<div class=\"objectives-grid\" style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1.5rem; margin-top: 2rem;\">\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #00c6ff;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Modelo (Model)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Responsable de la gestión de datos y lógica de dominio, incluyendo persistencia (ej. Room, Core Data), llamadas a APIs (Retrofit, Alamofire), validaciones de negocio y manejo de estados offline/online. No contiene lógica de presentación ni referencias a UI. Soporta patrones como Repository para múltiples fuentes de datos, asegurando idempotencia en operaciones asíncronas.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #9d50bb;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\">️ Vista (View)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Pasiva y enfocada en UI; renderiza elementos (RecyclerView, UITableView), captura eventos de usuario y los delega al Presentador sin procesamiento. No accede al Modelo ni contiene lógica condicional; solo implementa interfaces para recibir actualizaciones. Esto reduce complejidad en la Vista, facilitando adaptaciones a diferentes dispositivos.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #6e48aa;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Presentador (Presenter)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Centraliza la lógica de presentación (formateo de datos, validaciones UI, manejo de errores) y actúa como único puente; recibe eventos de Vista, consulta/actualiza Modelo y envía datos procesados a Vista. Independiente de UI para testabilidad; usa DI para inyección. En profundidad, maneja estados con máquinas de estado finitas para flujos complejos.</p>\n    </div>\n</div>"
                },
                {
                    "title": "3.3 Flujo de Comunicación View–Presenter",
                    "content": "\n<h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\">3.3 Flujo de Comunicación View–Presenter</h4>\n<p>Este subtema explica cómo la vista se comunica con el presentador mediante interfaces, y cómo el presentador actualiza la vista, mejorando la organización del código al promover desacoplamiento, testabilidad y reutilización en apps móviles. El flujo es bidireccional pero controlado: la Vista (pasiva) envía eventos al Presentador vía interfaces (contratos), evitando dependencias directas; el Presentador procesa, interactúa con el Modelo y actualiza la Vista.</p>\n\n<div class=\"flow-steps\" style=\"background: rgba(255,255,255,0.02); padding: 1.5rem; border-radius: 8px; margin-top: 1.5rem;\">\n    <h5 style=\"color: #fff; margin-bottom: 1rem;\">Ciclo de Comunicación Típico:</h5>\n    <ol style=\"margin-left: 1.5rem; color: #e0e0e0;\">\n        <li style=\"margin-bottom: 1rem;\"><strong>Interacción del usuario en la Vista:</strong> Captura eventos (ej. clic) y notifica al Presentador vía interfaz (ej. `presenter.onButtonClick()`).</li>\n        <li style=\"margin-bottom: 1rem;\"><strong>Procesamiento en el Presentador:</strong> Recibe la notificación, aplica lógica, interactúa con el Modelo (ej. fetch data).</li>\n        <li style=\"margin-bottom: 1rem;\"><strong>Actualización de la Vista:</strong> Presentador envía datos formateados a la Vista vía interfaz (ej. `view.showData(data)`), que refresca la UI.</li>\n    </ol>\n</div>\n<p style=\"margin-top: 1rem;\">Esto mejora organización al centralizar lógica en el Presentador, reduciendo acoplamiento.</p>\n\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <!-- Placeholder or generic flow diagram -->\n    <p style=\"font-size: 0.9rem; color: #888; margin-top: 0.5rem;\">Diagrama del flujo de comunicación View-Presenter</p>\n</div>"
                },
                {
                    "title": "3.4 Diferencias Estructurales entre MVC y MVP",
                    "content": "\n<h4 style=\"color: var(--accent-blue); margin-bottom: 1rem;\">3.4 Diferencias Estructurales entre MVC y MVP</h4>\n<p>Se comparan ambas arquitecturas, resaltando que MVP ofrece una separación más clara de responsabilidades que MVC, al centralizar la lógica en un Presentador independiente y eliminar el acoplamiento directo entre Vista y Modelo, lo que resulta en una estructura más modular y testable.</p>\n<p>Estructuralmente, MVC se basa en un Controlador que orquesta el flujo pero permite que la Vista acceda directamente al Modelo, creando dependencias bidireccionales y potenciales inflados en el Controlador (como \"Massive View Controller\" en iOS o \"God Activity\" en Android), mientras MVP introduce un Presentador como único mediador, haciendo la Vista completamente pasiva y utilizando interfaces para comunicación unidireccional (push de datos), alineado con principios SOLID como la inversión de dependencias para mayor extensibilidad.</p>\n<p>En MVC, el Modelo y la Vista pueden comunicarse bidireccionalmente (Vista \"tira\" datos del Modelo), lo que simplifica implementaciones iniciales pero complica el mantenimiento en apps móviles con estados dinámicos (ej. manejo de configuraciones como dark mode o multitarea), mientras MVP impone un flujo unidireccional (Vista envía eventos al Presentador, que \"empuja\" datos procesados), reduciendo complejidad cíclica y facilitando inyección de dependencias (DI) para escalabilidad.</p>\n<p>En contextos móviles, MVC es más nativo y simple para prototipos (ej. UIKit en iOS), pero MVP brilla en Android para apps con lógica asíncrona (ej. RxJava o Coroutines), ofreciendo una separación que previene violaciones de principios como SRP (Single Responsibility Principle) al distribuir responsabilidades de manera más granular.</p>\n\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <!-- Placeholder for comparative diagram -->\n    <p style=\"font-size: 0.9rem; color: #888; margin-top: 0.5rem;\">Diagrama comparativo estructural MVC vs MVP</p>\n</div>"
                },
                {
                    "title": "3.5 Análisis de Costos y Evaluación",
                    "content": "\n<p>Tabla detallada de evaluación para la arquitectura MVP.</p>\n<div class=\"table-responsive\" style=\"overflow-x: auto; margin-bottom: 2rem; border-radius: 8px; border: 1px solid #333;\">\n    <table style=\"width: 100%; border-collapse: collapse; min-width: 900px; font-size: 0.95rem;\">\n        <thead>\n            <tr style=\"background: linear-gradient(90deg, var(--accent-blue), var(--accent-purple)); color: white;\">\n                <th style=\"padding: 15px; text-align: left; width: 20%;\">Aspecto</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%; border-right: 1px solid rgba(255,255,255,0.2);\"> Ventaja (Por qué y Cuándo)</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%;\"> Desventaja (Por qué y Cuándo)</th>\n            </tr>\n        </thead>\n        <tbody>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Testing (Pruebas)</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Excelente.</strong> Es su mayor fortaleza. Al aislar el Presentador en código Java/Kotlin/Swift puro, se pueden probar flujos de UI completos usando JUnit y Mockito en milisegundos, sin necesidad de emuladores.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Requiere escribir una gran cantidad de Mocks para simular el comportamiento de las Vistas, lo cual puede ser tedioso al inicio.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Mantenimiento</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Muy bueno. La separación de responsabilidades es clara y forzada por interfaces. Si cambia el diseño visual, la lógica en el Presentador permanece intacta.</td>\n                <td style=\"padding: 15px; color: #ccc;\"><strong>Verbosidad Extrema.</strong> Por cada pantalla simple necesitas crear: ViewInterface, PresenterInterface, PresenterImplementation y la ViewImplementation (Activity). Genera mucho código \"boilerplate\".</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Escalabilidad</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Alta. Permite equipos grandes trabajando en paralelo (unos en Vistas, otros en Presentadores) gracias a los contratos de interfaz definidos previamente.</td>\n                <td style=\"padding: 15px; color: #ccc;\">El Presentador puede volverse muy grande (\"God Presenter\") si maneja demasiada lógica de negocio que debería estar en el Modelo o Dominio.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Curva de Aprendizaje</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Media. Conceptualmente es fácil de entender para quien viene de MVC.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Requiere disciplina férrea para no romper el patrón y llamar a funciones del SDK de Android dentro del Presentador.</td>\n            </tr>\n        </tbody>\n    </table>\n</div>"
                }
            ]
        },
        {
            "id": "4",
            "title": "Arquitectura MVVM (Model–View–ViewModel)",
            "description": "El estándar moderno. Programación reactiva, Data Binding y ciclos de vida conscientes.",
            "subtopics": [
                {
                    "title": "4.1 Definición de MVVM",
                    "content": "\n<div class=\"definition-box\" style=\"background: rgba(0,0,255,0.05); padding: 1.5rem; border-left: 5px solid var(--accent-blue); margin-bottom: 2rem; border-radius: 4px;\">\n    <h4 style=\"color: var(--accent-blue); margin-bottom: 0.5rem;\">Definición de MVVM</h4>\n    <p><strong>MVVM (Model-View-ViewModel)</strong> es la arquitectura recomendada oficialmente por Google (Android Jetpack) y Apple (SwiftUI) para el desarrollo moderno. Su diferenciador clave frente a MVP es el uso de <strong>Data Binding</strong> y la <strong>Programación Reactiva</strong>.</p>\n</div>\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/4.1.jpeg\" alt=\"MVVM Definition\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n</div>\n<p>A diferencia de MVP, donde el Presentador le dice imperativamente a la Vista qué hacer (`view.showLoading()`), en MVVM la Vista \"observa\" pasivamente los cambios en el ViewModel. El ViewModel no sabe quién lo está observando. Cuando el Modelo actualiza los datos, el ViewModel emite el nuevo valor y la Vista reacciona automáticamente actualizándose a sí misma. Esto invierte el flujo de control y elimina gran parte del código \"pegamento\" propenso a errores.</p>"
                },
                {
                    "title": "4.2 Componentes MVVM Detallados",
                    "content": "\n<p>MVVM se compone de tres piezas fundamentales que interactúan de forma desacoplada y reactiva:</p>\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/4.2.jpg\" alt=\"MVVM Components\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n</div>\n<div class=\"objectives-grid\" style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1.5rem; margin-top: 2rem;\">\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #00c6ff;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> Model (Modelo)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Capa de datos y lógica de negocio. Contiene el acceso a bases de datos (Room/CoreData), servicios de red (Retrofit/Alamofire) y repositorios. Es completamente ignorante de la UI y del ViewModel. Su responsabilidad es proveer datos correctos.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #9d50bb;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> ViewModel (Modelo de Vista)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Es el intermediario inteligente y el gestor del estado de la UI. Prepara y transforma los datos del Modelo para que sean consumibles por la Vista.\n        <br>1. <strong>Sobrevive a la configuración:</strong> No se destruye al rotar la pantalla.\n        <br>2. <strong>No conoce a la Vista:</strong> No tiene referencias a `Activity` o `View` (evita Memory Leaks).\n        <br>3. <strong>Expone Observables:</strong> Ofrece flujos de datos (LiveData, StateFlow) que la vista puede observar.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #6e48aa;\">\n        <h4 style=\"color: #fff; margin-bottom: 0.5rem;\"> View (Vista)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Totalmente reactiva. Su única responsabilidad es definir la estructura visual y suscribirse a los eventos del ViewModel. En Android puede ser XML con Data Binding o código Jetpack Compose; en iOS es SwiftUI. Cuando el dato cambia, la vista se redibuja sola.</p>\n    </div>\n</div>"
                },
                {
                    "title": "4.3 Data Binding y Observabilidad",
                    "content": "\n<h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\">La Magia del Data Binding</h4>\n<p>El Data Binding es el mecanismo que conecta automáticamente las propiedades de la UI con los datos del ViewModel, eliminando el código repetitivo de actualización manual (`findViewById`, `setText`, etc.).</p>\n<ul style=\"margin-left: 20px; color: #ccc; margin-bottom: 1.5rem;\">\n    <li><strong>Binding Unidireccional (@{user.name}):</strong> El flujo va del ViewModel a la Vista. Si el nombre cambia en la base de datos, el TextView se actualiza solo.</li>\n    <li><strong>Binding Bidireccional (@={user.name}):</strong> El flujo va en ambos sentidos. Si el usuario escribe en un campo de texto, la variable en el ViewModel se actualiza automáticamente, facilitando la validación de formularios.</li>\n</ul>\n<div style=\"background: #111; padding: 1rem; border-radius: 6px; border: 1px solid #333; font-family: monospace; color: #aaa;\">\n    <span style=\"color: #888;\">// Ejemplo conceptual (Kotlin/Compose)</span><br>\n    <span style=\"color: #c678dd;\">val</span> userName <span style=\"color: #56b6c2;\">by</span> viewModel.userName.observeAsState()<br>\n    <span style=\"color: #e06c75;\">Text</span>(text = userName) <span style=\"color: #888;\">// Se redibuja automáticamente solo cuando userName cambia</span>\n</div>"
                },
                {
                    "title": "4.4 Flujo de Implementación",
                    "content": "\n<p>Implementar MVVM requiere seguir un flujo estricto para mantener la integridad de la arquitectura:</p>\n<ol style=\"margin-left: 1.5rem; color: #e0e0e0; margin-top: 1rem;\">\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Definir el Modelo:</strong> Crear las entidades de datos, DAOs y Repositorios.</li>\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Crear el ViewModel:</strong> Inyectar el repositorio en el constructor. Exponer objetos `LiveData` o `StateFlow` públicos (inmutables) para cada elemento de la UI que necesite datos dinámicos.</li>\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Diseñar la Vista:</strong> Crear el layout XML o la función Composable.</li>\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Suscribir:</strong> En el método `onCreate` de la Activity/Fragment, observar los LiveData del ViewModel. Definir la lógica de \"qué hacer\" cuando el dato cambia (actualizar UI).</li>\n    <li style=\"margin-bottom: 0.5rem;\"><strong>Manejar Eventos:</strong> Los clics en la Vista no ejecutan lógica; simplemente llaman a funciones semánticas del ViewModel (`viewModel.onLoginClicked()`).</li>\n</ol>"
                },
                {
                    "title": "4.5 Análisis de Costos y Evaluación",
                    "content": "\n<p>Tabla detallada de evaluación para la arquitectura MVVM.</p>\n<div class=\"table-responsive\" style=\"overflow-x: auto; margin-bottom: 2rem; border-radius: 8px; border: 1px solid #333;\">\n    <table style=\"width: 100%; border-collapse: collapse; min-width: 900px; font-size: 0.95rem;\">\n        <thead>\n            <tr style=\"background: linear-gradient(90deg, var(--accent-blue), var(--accent-purple)); color: white;\">\n                <th style=\"padding: 15px; text-align: left; width: 20%;\">Aspecto</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%; border-right: 1px solid rgba(255,255,255,0.2);\"> Ventaja (Por qué y Cuándo)</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%;\"> Desventaja (Por qué y Cuándo)</th>\n            </tr>\n        </thead>\n        <tbody>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Productividad y Velocidad</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Muy alta.</strong> El Data Binding elimina miles de líneas de código repetitivo de actualización de UI. Menos código significa menos bugs superficiales y desarrollo más rápido de pantallas complejas.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Curva de aprendizaje inicial alta. Requiere que el equipo domine conceptos complejos como Observables, LiveData, StateFlow, Corrutinas/Combine y Ciclos de Vida.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Testing (Pruebas)</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">El ViewModel es extremadamente fácil de testear unitariamente ya que no tiene referencias a la Vista ni al SDK de Android. Se pueden simular flujos de datos complejos.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Testear el Data Binding en sí mismo es difícil o imposible. Si se incluye lógica de negocio dentro del XML (mala práctica común), esa lógica queda fuera de las pruebas.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Mantenimiento</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Excelente. El desacoplamiento total permite cambiar la UI (ej: de XML a Compose) manteniendo el mismo ViewModel y lógica de negocio intactos.</td>\n                <td style=\"padding: 15px; color: #ccc;\">En aplicaciones gigantes, los ViewModels pueden volverse muy grandes y complejos si no se dividen adecuadamente o si asumen demasiadas responsabilidades.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Debugging</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Buena separación lógica que ayuda a localizar errores de negocio.</td>\n                <td style=\"padding: 15px; color: #ccc;\">A veces el Data Binding es \"mágico\". Si algo falla en la conexión XML-ViewModel, el error puede ser críptico, silencioso y muy difícil de rastrear.</td>\n            </tr>\n        </tbody>\n    </table>\n</div>"
                }
            ]
        },
        {
            "id": "5",
            "title": "Arquitectura MVI (Model–View–Intent)",
            "description": "El enfoque funcional y reactivo. Estados inmutables y flujos unidireccionales para máxima previsibilidad.",
            "subtopics": [
                {
                    "title": "5.1 Definición de MVI",
                    "content": "\n<div class=\"definition-box\" style=\"background: rgba(0,0,255,0.05); padding: 1.5rem; border-left: 5px solid var(--accent-blue); margin-bottom: 2rem; border-radius: 4px;\">\n    <h4 style=\"color: var(--accent-blue); margin-bottom: 0.5rem;\">Definición de MVI</h4>\n    <p><strong>MVI (Model-View-Intent)</strong> es un patrón arquitectónico que trata la interfaz de usuario como una máquina de estados finitos. Inspirado en Redux (Web) y Cycle.js, propone un flujo de datos <strong>estrictamente unidireccional y cíclico</strong>.</p>\n</div>\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/5.1.jpg\" alt=\"MVI Definition\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n</div>\n<p>La regla de oro inquebrantable de MVI es: <strong>El estado es inmutable.</strong> Nunca modificas un campo de un objeto de estado existente; en su lugar, creas un nuevo objeto de estado completo para cada cambio, por mínimo que sea. Esto permite tener un historial perfecto de todo lo que ha ocurrido en la aplicación, habilitando características avanzadas de depuración y asegurando que la UI siempre sea un reflejo exacto del último estado conocido.</p>"
                },
                {
                    "title": "5.2 Componentes de MVI",
                    "content": "\n<p>MVI redefine los componentes tradicionales con un enfoque funcional:</p>\n<ul style=\"margin-left: 20px; color: #ccc; margin-bottom: 1.5rem;\">\n    <li style=\"margin-bottom: 1rem;\"><strong>Model (Estado):</strong> No se refiere solo a la capa de base de datos, sino al <em>Estado Único de la Verdad</em> de la UI. Es un objeto inmutable (Data Class) que contiene TODO lo necesario para pintar la pantalla en un instante dado (ej: `{ isLoading: true, userList: [], error: null }`).</li>\n    <li style=\"margin-bottom: 1rem;\"><strong>View (Vista):</strong> Se comporta como una función matemática pura `f(Model) -> UI`. Cada vez que recibe un nuevo objeto Modelo, se \"repinta\" (conceptualmente) para reflejarlo. No mantiene estado interno propio.</li>\n    <li style=\"margin-bottom: 1rem;\"><strong>Intent (Intención):</strong> Representa la <em>intención</em> del usuario de realizar una acción. No debe confundirse con el `android.content.Intent`. Es un evento semántico como `LoadUserIntent`, `SubmitLoginIntent` o `TypeSearchTermIntent`.</li>\n</ul>"
                },
                {
                    "title": "5.3 Flujo Unidireccional Detallado",
                    "content": "\n<div class=\"flow-steps\" style=\"background: rgba(255,255,255,0.02); padding: 1.5rem; border-radius: 8px; margin-top: 1.5rem;\">\n    <h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\"> Ciclo Unidireccional (UDF)</h4>\n    <p style=\"margin-bottom: 1rem;\">El dato viaja en una sola dirección en un ciclo cerrado, eliminando efectos secundarios inesperados y condiciones de carrera:</p>\n    <ol style=\"margin-left: 1.5rem; color: #e0e0e0;\">\n        <li style=\"margin-bottom: 1rem;\"><strong>User Event:</strong> El usuario interactúa (hace clic en un botón).</li>\n        <li style=\"margin-bottom: 1rem;\"><strong>Intent:</strong> La vista traduce esa interacción en un `Intent` y lo envía al procesador central (ViewModel/Store).</li>\n        <li style=\"margin-bottom: 1rem;\"><strong>Reducer/Processor:</strong> Una función pura toma el <em>Estado Actual</em> + <em>Intención</em> y calcula matemáticamente el <em>Estado Nuevo</em>. No muta nada, crea algo nuevo.</li>\n        <li style=\"margin-bottom: 1rem;\"><strong>State Emission:</strong> El nuevo estado inmutable se emite por el canal de eventos.</li>\n        <li style=\"margin-bottom: 1rem;\"><strong>Render:</strong> La Vista recibe el nuevo estado y se actualiza para reflejarlo.</li>\n    </ol>\n</div>"
                },
                {
                    "title": "5.4 Gestión de Estado e Inmutabilidad",
                    "content": "\n<h4 style=\"color: var(--accent-blue);\">La importancia crítica de la Inmutabilidad</h4>\n<p>En arquitecturas como MVVM, a menudo tenemos múltiples variables observables (`isLoading`, `userList`, `errorText`). Esto puede llevar a estados inconsistentes imposibles (ej: `isLoading=false`, pero `errorText` vacío y `userList` vacío... ¿qué pasó? ¿se cargó? ¿hubo error?).</p>\n<p>En MVI, hay <strong>UN solo objeto de estado</strong> que agrupa todo. No puedes tener un estado inválido si diseñas bien tu modelo (ej: usando Sealed Classes en Kotlin como `State.Loading`, `State.Success`, `State.Error`). El estado representa una \"foto\" exacta y validada de la UI en un momento dado. Esto hace que los bugs de sincronización de estado (loading spinners que no desaparecen, datos mezclados) desaparezcan por completo.</p>"
                },
                {
                    "title": "5.5 Análisis de Costos y Evaluación",
                    "content": "\n<p>Tabla detallada de evaluación para la arquitectura MVI.</p>\n<div class=\"table-responsive\" style=\"overflow-x: auto; margin-bottom: 2rem; border-radius: 8px; border: 1px solid #333;\">\n    <table style=\"width: 100%; border-collapse: collapse; min-width: 900px; font-size: 0.95rem;\">\n        <thead>\n            <tr style=\"background: linear-gradient(90deg, var(--accent-blue), var(--accent-purple)); color: white;\">\n                <th style=\"padding: 15px; text-align: left; width: 20%;\">Aspecto</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%; border-right: 1px solid rgba(255,255,255,0.2);\"> Ventaja (Por qué y Cuándo)</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%;\"> Desventaja (Por qué y Cuándo)</th>\n            </tr>\n        </thead>\n        <tbody>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Consistencia y Predecibilidad</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Total.</strong> Es imposible tener estados inconsistentes. La aplicación se comporta de manera determinista. Si ocurre un error, es fácil de reproducir con el historial de estados.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Rigidez. Cambios simples pueden requerir actualizar múltiples partes del flujo (Intent, State, Reducer).</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Debugging</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Superior a cualquier otra arquitectura. Los logs muestran claramente: \"Llegó Intento X -> Estado cambió de A a B\". Permite \"Time Travel Debugging\".</td>\n                <td style=\"padding: 15px; color: #ccc;\">Puede ser abrumador leer logs gigantes de objetos de estado complejos si no se tienen herramientas adecuadas.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Testing</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Excelente. Los Reducers son funciones puras (Entrada -> Salida) sin efectos secundarios, lo que los hace triviales de probar unitariamente.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Requiere escribir muchos tests para cubrir todas las combinaciones posibles de estados.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Rendimiento (Performance)</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Bueno en la mayoría de los casos modernos.</td>\n                <td style=\"padding: 15px; color: #ccc;\"><strong>Gestión de Memoria.</strong> Crear un nuevo objeto de estado por cada pequeña interacción (ej: teclear un carácter en un buscador) puede causar presión excesiva en el Garbage Collector (GC) y lag si no se optimiza con `distinctUntilChanged`.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Curva de Aprendizaje</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Baja para desarrolladores familiarizados con Redux o React.</td>\n                <td style=\"padding: 15px; color: #ccc;\"><strong>Muy Alta (Bloqueante).</strong> Requiere un cambio mental total hacia la programación funcional y reactiva. Muy difícil para equipos acostumbrados a programación imperativa tradicional.</td>\n            </tr>\n        </tbody>\n    </table>\n</div>"
                }
            ]
        },
        {
            "id": "6",
            "title": "Clean Architecture en Aplicaciones Móviles",
            "description": "Organización en capas concéntricas para la independencia total.",
            "subtopics": [
                {
                    "title": "6.1 Definición de Clean Architecture",
                    "content": "\n<div class=\"definition-box\" style=\"background: rgba(0,0,255,0.05); padding: 1.5rem; border-left: 5px solid var(--accent-blue); margin-bottom: 2rem; border-radius: 4px;\">\n    <h4 style=\"color: var(--accent-blue); margin-bottom: 0.5rem;\">Definición de Clean Architecture</h4>\n    <p>Clean Architecture es un enfoque arquitectónico propuesto por Robert C. Martin (Uncle Bob) que organiza el software en capas concéntricas. A diferencia de patrones de interfaz de usuario como MVC o MVVM (que se enfocan en cómo mostrar datos), Clean Architecture abarca <strong>toda la estructura de la aplicación</strong>, desde la base de datos hasta la interfaz de usuario, pasando por la lógica de negocio.</p>\n</div>\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/6.1.jpg\" alt=\"Clean Architecture Definition\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n</div>\n<p>Su objetivo fundamental es la <strong>Separación de Intereses (Separation of Concerns)</strong> para crear sistemas que sean:</p>\n<ul style=\"margin-left: 20px; color: #ccc; margin-bottom: 1rem;\">\n    <li><strong>Independientes de Frameworks:</strong> La arquitectura no depende de la existencia de una librería cargada de características. Esto te permite usar frameworks como herramientas, en lugar de encajonar tu sistema en sus limitaciones.</li>\n    <li><strong>Testables:</strong> Las reglas de negocio se pueden probar sin la UI, base de datos, servidor web, o cualquier otro elemento externo.</li>\n    <li><strong>Independientes de la UI:</strong> La interfaz de usuario puede cambiar fácilmente sin cambiar el resto del sistema. Una UI web podría ser reemplazada por una UI de consola, sin cambiar las reglas de negocio.</li>\n    <li><strong>Independientes de la Base de Datos:</strong> Puedes cambiar Oracle o SQL Server por Mongo, BigTable, CouchDB, o cualquier otra cosa. Tus reglas de negocio no están atadas a la base de datos.</li>\n</ul>"
                },
                {
                    "title": "6.2 La Regla de Dependencia",
                    "content": "\n<h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\">La Regla de Dependencia (El Principio Fundamental)</h4>\n<p>La regla que gobierna todo este movimiento es simple pero estricta: <strong>Las dependencias de código fuente solo pueden apuntar hacia adentro</strong>.</p>\n<div style=\"background: rgba(255,255,255,0.02); padding: 1.5rem; border-radius: 8px; border: 1px solid #333;\">\n    <p>Nada en un círculo interno puede saber absolutamente nada sobre algo en un círculo externo. Esto incluye funciones, clases, variables o cualquier otra entidad de software nombrada.</p>\n    <ul style=\"margin-left: 20px; color: #ccc; margin-top: 1rem;\">\n        <li>Por ejemplo, la capa de Dominio (Círculo más interno) <strong>NO</strong> puede tener una clase que importe `android.os.Bundle` o `java.sql.SQLException`.</li>\n        <li>Los formatos de datos usados en un círculo externo no deben ser usados por un círculo interno. No queremos que la estructura de la base de datos o el JSON de la API dicte cómo funciona nuestra lógica de negocio.</li>\n    </ul>\n</div>\n<p style=\"margin-top: 1rem;\">Esta regla es la que garantiza que si mañana Google decide deprecar una librería de Android, o si decides cambiar de base de datos SQL a Realm, tu lógica de negocio (el corazón de tu app) permanezca intacta y segura.</p>"
                },
                {
                    "title": "6.3 Capas y Estructura",
                    "content": "\n<h4 style=\"color: var(--accent-blue); margin-bottom: 1rem;\">Capas y Estructura (De adentro hacia afuera)</h4>\n<p>Clean Architecture se visualiza comúnmente como una serie de anillos concéntricos:</p>\n<div class=\"objectives-grid\" style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1.5rem; margin-top: 2rem;\">\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #ffcc00;\">\n        <h4 style=\"color: #ffcc00; margin-bottom: 0.5rem;\">1. Entidades (Amarillo - Centro)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Objetos de negocio puros. Encapsulan las <strong>Reglas de Negocio de la Empresa</strong> más generales y de alto nivel. Son las menos propensas a cambiar ante cambios externos (como cambios en la navegación o seguridad). Ejemplo: Una entidad `Prestamo` que calcula su propio interés.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #ff6666;\">\n        <h4 style=\"color: #ff6666; margin-bottom: 0.5rem;\">2. Casos de Uso (Rojo)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Contienen las <strong>Reglas de Negocio de la Aplicación</strong>. Orquestan el flujo de datos hacia y desde las entidades. Dirigen a las entidades para que usen su lógica para lograr los objetivos del caso de uso. Ejemplo: `SolicitarPrestamoUseCase`.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #66cc66;\">\n        <h4 style=\"color: #66cc66; margin-bottom: 0.5rem;\">3. Adaptadores de Interfaz (Verde)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Convierten datos del formato más conveniente para los casos de uso y entidades, al formato más conveniente para algún agente externo como la Base de Datos o la Web. Aquí viven los Presenters, ViewModels y Controladores.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-top: 3px solid #3399ff;\">\n        <h4 style=\"color: #3399ff; margin-bottom: 0.5rem;\">4. Frameworks y Drivers (Azul - Externo)</h4>\n        <p style=\"font-size: 0.9rem; color: #ccc;\">Donde van todos los detalles: La UI, la Base de Datos, el Framework Web, Dispositivos, etc. Aquí es donde escribes código específico de Android o iOS. Es la capa más volátil y sucia.</p>\n    </div>\n</div>"
                },
                {
                    "title": "6.4 Cruzando Fronteras (Inversión de Control)",
                    "content": "\n<h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\">Cruzando las fronteras (Inversión de Control)</h4>\n<p>Una pregunta común es: <em>\"¿Cómo puede un Caso de Uso (interno) llamar a un Presenter o guardar datos en una Base de Datos (externos) si la Regla de Dependencia prohíbe mirar hacia afuera?\"</em></p>\n<div style=\"background: rgba(255,255,255,0.05); padding: 1.5rem; border-radius: 8px; border-left: 4px solid var(--accent-blue);\">\n    <h5 style=\"color: #fff; margin-bottom: 0.5rem;\">La Respuesta: El Principio de Inversión de Dependencias (DIP)</h5>\n    <p>En lugar de llamar directamente a la clase concreta de la capa externa, el código interno define una <strong>Interfaz</strong> (un contrato) dentro de su propia capa.</p>\n    <ul style=\"margin-left: 20px; color: #ccc; margin-top: 0.5rem;\">\n        <li><strong>Paso 1:</strong> El Caso de Uso define una interfaz `UserRepository` con un método `save(User)`. Esta interfaz vive en la capa de Dominio (Adentro).</li>\n        <li><strong>Paso 2:</strong> La capa de Datos (Afuera) implementa esa interfaz con una clase `UserRepositoryImpl` que usa SQL o Retrofit.</li>\n        <li><strong>Resultado:</strong> En tiempo de compilación, la capa externa depende de la interna (para implementar la interfaz). En tiempo de ejecución, el flujo de control viaja hacia afuera (para guardar el dato), pero la dependencia de código se mantiene apuntando hacia adentro.</li>\n    </ul>\n</div>\n<div class=\"diagram-placeholder\" style=\"margin: 2rem 0; text-align: center;\">\n    <img src=\"images/6.4.jpg\" alt=\"Clean Architecture Inversion of Control\" style=\"max-width: 100%; border-radius: 8px; border: 1px solid #333; box-shadow: 0 0 20px rgba(0,0,255,0.2);\">\n</div>\n<p style=\"margin-top: 1rem;\">Esto es lo que permite que Clean Architecture sea \"plug-in\". Puedes \"enchufar\" diferentes implementaciones de base de datos o UI sin que el núcleo del sistema se entere.</p>"
                },
                {
                    "title": "6.5 Ventajas y Desventajas",
                    "content": "\n<p>Tabla detallada de evaluación para Clean Architecture.</p>\n<div class=\"table-responsive\" style=\"overflow-x: auto; margin-bottom: 2rem; border-radius: 8px; border: 1px solid #333;\">\n    <table style=\"width: 100%; border-collapse: collapse; min-width: 900px; font-size: 0.95rem;\">\n        <thead>\n            <tr style=\"background: linear-gradient(90deg, var(--accent-blue), var(--accent-purple)); color: white;\">\n                <th style=\"padding: 15px; text-align: left; width: 20%;\">Aspecto</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%; border-right: 1px solid rgba(255,255,255,0.2);\"> Ventaja (Por qué y Cuándo)</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%;\"> Desventaja (Por qué y Cuándo)</th>\n            </tr>\n        </thead>\n        <tbody>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Costo inicial de implementación</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Permite una estructura altamente organizada desde el inicio, reduciendo errores futuros y facilitando el crecimiento del sistema.</td>\n                <td style=\"padding: 15px; color: #ccc;\"><strong>Alto costo inicial.</strong> Requiere mucho tiempo de diseño, planificación y creación de estructura (scaffolding) debido a la gran cantidad de capas y abstracciones.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Infraestructura y herramientas</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Independiente de frameworks o tecnologías. Permite cambiar librerías (ej: Gson a Moshi) sin afectar la lógica principal.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Requiere mayor configuración del proyecto, gestión de dependencias compleja (Gradle multi-módulo) y conocimiento avanzado del equipo.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Tiempo de desarrollo</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Disminuye drásticamente el retrabajo en proyectos grandes gracias a la clara separación entre capas (dominio, datos y presentación).</td>\n                <td style=\"padding: 15px; color: #ccc;\">Desarrollo inicial más lento. Para una funcionalidad simple se deben tocar múltiples archivos (Entity, UseCase, Repository Interface, Repository Impl, DTO, Mapper, ViewModel).</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Escalabilidad</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Muy alta.</strong> Ideal para aplicaciones empresariales o proyectos de larga duración (+5 años). Soporta equipos grandes sin conflictos.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Puede resultar una sobreingeniería excesiva y absurda para aplicaciones pequeñas, prototipos rápidos o apps con vida útil corta.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Mantenimiento a largo plazo</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Gran ventaja.</strong> El código no \"envejece\" tanto porque el núcleo está protegido. Facilita modificaciones y actualizaciones tecnológicas.</td>\n                <td style=\"padding: 15px; color: #ccc;\">La complejidad estructural puede dificultar la comprensión y navegación del código para desarrolladores nuevos o sin experiencia en el patrón.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Testing (Pruebas)</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Excelente soporte para pruebas unitarias al aislar completamente la lógica de negocio en clases puras Java/Kotlin.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Configurar el entorno de pruebas e inyección de dependencias puede requerir mayor preparación técnica inicial.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Comparación con MVC, MVP, MVVM</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Mejor separación de responsabilidades y menor dependencia tecnológica que cualquiera de los anteriores, aumentando la estabilidad.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Mucho más compleja y costosa de implementar que MVC, MVP o MVVM. No es un reemplazo directo, sino una estructura que envuelve a estos patrones de UI.</td>\n            </tr>\n        </tbody>\n    </table>\n</div>"
                }
            ]
        },
        {
            "id": "7",
            "title": "Arquitectura en capas (Layered Architecture)",
            "description": "Organización jerárquica tradicional. Separación lógica por niveles de responsabilidad.",
            "subtopics": [
                {
                    "title": "7.1 Definición de Arquitectura en Capas",
                    "content": "\n<div class=\"definition-box\" style=\"background: rgba(0,0,255,0.05); padding: 1.5rem; border-left: 5px solid var(--accent-blue); margin-bottom: 2rem; border-radius: 4px;\">\n    <h4 style=\"color: var(--accent-blue); margin-bottom: 0.5rem;\">Definición Clásica</h4>\n    <p><strong>Layered Architecture</strong> (Arquitectura en Capas) es el estilo arquitectónico más común, intuitivo y tradicional en el desarrollo de software. Organiza el código en capas horizontales apiladas una sobre otra, donde cada capa tiene un rol específico y solo puede comunicarse con las capas adyacentes.</p>\n</div>\n<p>Es el punto de partida estándar para la mayoría de aplicaciones empresariales monolíticas antes de evolucionar a arquitecturas más complejas como Hexagonal o Clean. Su principio es la <strong>Separación de Intereses (Separation of Concerns)</strong> basada en la abstracción técnica (UI, Lógica, Datos).</p>"
                },
                {
                    "title": "7.2 Capas Típicas",
                    "content": "\n<p>Típicamente se divide en 3 o 4 capas estándar que forman una jerarquía estricta:</p>\n<ul style=\"margin-left: 20px; color: #ccc; margin-bottom: 1.5rem;\">\n    <li style=\"margin-bottom: 1rem;\"><strong>Presentation Layer (UI):</strong> La capa superior. Maneja la interacción con el usuario y presenta la información. Solo habla con la capa de Dominio/Negocio. No accede a la base de datos directamente.</li>\n    <li style=\"margin-bottom: 1rem;\"><strong>Domain/Business Layer:</strong> Contiene la lógica de negocio. Es el corazón de la funcionalidad. Procesa comandos de la UI, aplica reglas y consulta datos a la capa de Persistencia.</li>\n    <li style=\"margin-bottom: 1rem;\"><strong>Persistence/Data Layer:</strong> Se encarga de guardar y recuperar datos (SQL, Archivos, APIs). Abstrae los detalles técnicos del almacenamiento para que el negocio no se preocupe por SQL.</li>\n    <li style=\"margin-bottom: 1rem;\"><strong>Database Layer:</strong> La base de datos física o el servicio externo real subyacente.</li>\n</ul>"
                },
                {
                    "title": "7.3 Interacción entre Capas",
                    "content": "\n<h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\">Patrones de Interacción</h4>\n<p>Existen dos variantes principales en cómo las capas se comunican entre sí:</p>\n<ul style=\"margin-left: 20px; color: #ccc;\">\n    <li><strong>Capas Cerradas (Closed Layers - Strict):</strong> Una capa solo puede llamar a la inmediatamente inferior. Esto reduce el acoplamiento al máximo, pero puede generar \"Proxy Methods\" innecesarios que solo pasan datos sin hacer nada (Sinkhole Anti-pattern).</li>\n    <li><strong>Capas Abiertas (Open Layers - Relaxed):</strong> Una capa puede saltarse a la intermedia y llamar a una capa inferior (ej: UI llamando a Persistencia para leer datos de solo lectura). Mejora el rendimiento y reduce código, pero aumenta peligrosamente el acoplamiento y el riesgo de \"Spaghetti Code\".</li>\n</ul>"
                },
                {
                    "title": "7.4 Análisis de Costos y Evaluación",
                    "content": "\n<p>Tabla detallada de evaluación para la Arquitectura en Capas.</p>\n<div class=\"table-responsive\" style=\"overflow-x: auto; margin-bottom: 2rem; border-radius: 8px; border: 1px solid #333;\">\n    <table style=\"width: 100%; border-collapse: collapse; min-width: 900px; font-size: 0.95rem;\">\n        <thead>\n            <tr style=\"background: linear-gradient(90deg, var(--accent-blue), var(--accent-purple)); color: white;\">\n                <th style=\"padding: 15px; text-align: left; width: 20%;\">Aspecto</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%; border-right: 1px solid rgba(255,255,255,0.2);\"> Ventaja (Por qué y Cuándo)</th>\n                <th style=\"padding: 15px; text-align: left; width: 40%;\"> Desventaja (Por qué y Cuándo)</th>\n            </tr>\n        </thead>\n        <tbody>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Costo inicial y Facilidad</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\"><strong>Muy Bajo.</strong> Es muy fácil de entender, configurar e iniciar. Es el \"estándar mental\" de la mayoría de desarrolladores. Ideal para empezar rápido.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Tiende a degenerar en una \"Gran Bola de Lodo\" (Big Ball of Mud) si no se respetan los límites estrictamente, ya que no hay reglas físicas que impidan saltar capas.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Despliegue y Modificación</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Sencillo en apps monolíticas pequeñas.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Un cambio simple en la base de datos (ej: añadir un campo a una tabla) a menudo requiere cambios en cascada en TODAS las capas superiores (DTOs, Dominio, UI), rompiendo la encapsulación y aumentando el riesgo de errores.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Testing</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Bueno si se usan interfaces entre capas.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Si las capas están acopladas directamente (clases concretas instanciando clases concretas), es muy difícil de probar unitariamente sin levantar todo el sistema.</td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Escalabilidad</td>\n                <td style=\"padding: 15px; border-right: 1px solid #333; color: #ccc;\">Media. Funciona para aplicaciones de negocio estándar.</td>\n                <td style=\"padding: 15px; color: #ccc;\">Mala para alta concurrencia o sistemas distribuidos. Tiende a crear \"cuellos de botella\" en capas específicas.</td>\n            </tr>\n        </tbody>\n    </table>\n</div>"
                }
            ]
        },
        {
            "id": "8",
            "title": "Comparación de arquitecturas móviles",
            "description": "Análisis final, gráficos comparativos y guía de decisión estratégica.",
            "subtopics": [
                {
                    "title": "8.1 Comparativa Visual e Interactiva",
                    "content": "\n<div class=\"charts-container\" style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 2rem; margin-top: 2rem;\">\n    <div class=\"chart-box\" style=\"background: #111; padding: 1rem; border-radius: 12px; border: 1px solid #333;\">\n        <h4 style=\"text-align: center; margin-bottom: 1rem;\">Nivel de Testabilidad</h4>\n        <canvas id=\"testabilityChart\"></canvas>\n    </div>\n    <div class=\"chart-box\" style=\"background: #111; padding: 1rem; border-radius: 12px; border: 1px solid #333;\">\n        <h4 style=\"text-align: center; margin-bottom: 1rem;\">Curva de Aprendizaje</h4>\n        <canvas id=\"complexityChart\"></canvas>\n    </div>\n</div>\n<div class=\"chart-box\" style=\"background: #111; padding: 1rem; border-radius: 12px; border: 1px solid #333; margin-top: 2rem;\">\n    <h4 style=\"text-align: center; margin-bottom: 1rem;\">Comparativa General (Radar)</h4>\n    <div style=\"max-width: 600px; margin: 0 auto;\">\n        <canvas id=\"radarChart\"></canvas>\n    </div>\n</div>\n<script src=\"https://cdn.jsdelivr.net/npm/chart.js\"></script>\n<script>\n    (function() {\n        Chart.defaults.color = \"#ccc\";\n        Chart.defaults.borderColor = \"#333\";\n        new Chart(document.getElementById(\"testabilityChart\"), {\n            type: \"bar\",\n            data: {\n                labels: [\"MVC\", \"MVP\", \"MVVM\", \"MVI\", \"Clean Arch\"],\n                datasets: [{\n                    label: \"Nivel de Testabilidad (1-10)\",\n                    data: [3, 8, 9, 9.5, 10],\n                    backgroundColor: [\"rgba(255, 99, 132, 0.6)\", \"rgba(54, 162, 235, 0.6)\", \"rgba(255, 206, 86, 0.6)\", \"rgba(75, 192, 192, 0.6)\", \"rgba(153, 102, 255, 0.6)\"],\n                    borderColor: [\"rgba(255, 99, 132, 1)\", \"rgba(54, 162, 235, 1)\", \"rgba(255, 206, 86, 1)\", \"rgba(75, 192, 192, 1)\", \"rgba(153, 102, 255, 1)\"],\n                    borderWidth: 1\n                }]\n            },\n            options: { scales: { y: { beginAtZero: true, max: 10 } } }\n        });\n        new Chart(document.getElementById(\"complexityChart\"), {\n            type: \"doughnut\",\n            data: {\n                labels: [\"MVC (Baja)\", \"MVP (Media)\", \"MVVM (Media-Alta)\", \"MVI (Alta)\", \"Clean Arch (Muy Alta)\"],\n                datasets: [{\n                    data: [20, 40, 60, 80, 100],\n                    backgroundColor: [\"#4ade80\", \"#60a5fa\", \"#facc15\", \"#f472b6\", \"#a78bfa\"],\n                    hoverOffset: 20\n                }]\n            },\n            options: { cutout: \"60%\" }\n        });\n        new Chart(document.getElementById(\"radarChart\"), {\n            type: \"radar\",\n            data: {\n                labels: [\"Escalabilidad\", \"Mantenibilidad\", \"Testabilidad\", \"Facilidad Inicio\", \"Performance UI\"],\n                datasets: [\n                    { label: \"MVC\", data: [3, 3, 3, 9, 7], fill: true, backgroundColor: \"rgba(255, 99, 132, 0.2)\", borderColor: \"rgb(255, 99, 132)\", pointBackgroundColor: \"rgb(255, 99, 132)\" },\n                    { label: \"MVVM\", data: [8, 8, 9, 6, 9], fill: true, backgroundColor: \"rgba(54, 162, 235, 0.2)\", borderColor: \"rgb(54, 162, 235)\", pointBackgroundColor: \"rgb(54, 162, 235)\" },\n                    { label: \"MVI\", data: [9, 9, 9, 4, 8], fill: true, backgroundColor: \"rgba(75, 192, 192, 0.2)\", borderColor: \"rgb(75, 192, 192)\", pointBackgroundColor: \"rgb(75, 192, 192)\" }\n                ]\n            },\n            options: { elements: { line: { borderWidth: 3 } }, scales: { r: { min: 0, max: 10, ticks: { display: false }, grid: { color: \"#444\" } } } }\n        });\n    })();\n</script>"
                },
                {
                    "title": "8.2 Escenarios del Mundo Real",
                    "content": "\n<h4 style=\"color: var(--accent-purple); margin-bottom: 1rem;\">Escenarios del Mundo Real: ¿Qué elegir?</h4>\n<div class=\"objectives-grid\" style=\"display: grid; grid-template-columns: repeat(auto-fit, minmax(300px, 1fr)); gap: 1.5rem; margin-top: 1rem;\">\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-left: 4px solid #4ade80;\">\n        <h5 style=\"color: #fff; margin-bottom: 0.5rem;\">Startup / MVP (Producto Mínimo Viable)</h5>\n        <p style=\"font-size: 0.9rem; color: #ccc;\"><strong>Elección: MVC o MVVM Simple.</strong></p>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">Necesitas velocidad. No pierdas tiempo configurando inyección de dependencias compleja o capas abstractas. Un MVC bien organizado o un MVVM básico (sin Clean Arch) es suficiente para validar tu idea en el mercado.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-left: 4px solid #60a5fa;\">\n        <h5 style=\"color: #fff; margin-bottom: 0.5rem;\">App Bancaria / Fintech</h5>\n        <p style=\"font-size: 0.9rem; color: #ccc;\"><strong>Elección: Clean Architecture + MVI.</strong></p>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">La seguridad y la consistencia de los datos son críticas. MVI asegura que no haya estados inválidos en la UI (ej: mostrar saldo mientras carga). Clean Architecture protege la lógica financiera de cambios en la UI.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-left: 4px solid #facc15;\">\n        <h5 style=\"color: #fff; margin-bottom: 0.5rem;\">App de Noticias / Blog</h5>\n        <p style=\"font-size: 0.9rem; color: #ccc;\"><strong>Elección: MVVM + Repository.</strong></p>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">El contenido es principalmente lectura. MVVM con Data Binding facilita mostrar listas y detalles. El patrón Repository maneja el caché offline (Room/Realm) de forma transparente para el usuario.</p>\n    </div>\n    <div class=\"objective-card\" style=\"background: #1a1a1a; padding: 1.5rem; border-radius: 8px; border-left: 4px solid #f472b6;\">\n        <h5 style=\"color: #fff; margin-bottom: 0.5rem;\">App Legacy (Código Antiguo)</h5>\n        <p style=\"font-size: 0.9rem; color: #ccc;\"><strong>Elección: Refactorización progresiva a MVP/MVVM.</strong></p>\n        <p style=\"font-size: 0.9rem; color: #aaa;\">Si tienes \"God Activities\" en MVC, empieza extrayendo la lógica a Presenters (MVP) para poder testearla. No intentes reescribir todo a Clean Architecture de golpe o paralizarás el negocio.</p>\n    </div>\n</div>"
                },
                {
                    "title": "8.3 Ejemplos Prácticos de cada Modelo",
                    "content": "\n<h4 style=\"color: var(--accent-blue); margin-bottom: 1rem;\">Ejemplos Prácticos de Implementación</h4>\n<p>Comparativa de código para una misma tarea: <strong>Mostrar un mensaje de \"Hola Mundo\" al hacer clic en un botón.</strong></p>\n\n<div style=\"margin-top: 2rem;\">\n    <h5 style=\"color: #4ade80;\">1. MVC (Android)</h5>\n    <pre style=\"background:#111; color:#ccc; padding:1rem; border-radius:6px; font-size:0.8rem;\">\n// Activity actúa como Controller y conoce a la View\nbutton.setOnClickListener {\n    textView.text = \"Hola Mundo\" // Modificación directa de la View\n}\n    </pre>\n</div>\n\n<div style=\"margin-top: 2rem;\">\n    <h5 style=\"color: #60a5fa;\">2. MVP</h5>\n    <pre style=\"background:#111; color:#ccc; padding:1rem; border-radius:6px; font-size:0.8rem;\">\n// Presenter (Lógica pura, sin Android SDK)\nfun onButtonClick() {\n    view.showText(\"Hola Mundo\") // Llama a interfaz\n}\n\n// Activity (Implementa View)\noverride fun showText(text: String) {\n    textView.text = text\n}\n    </pre>\n</div>\n\n<div style=\"margin-top: 2rem;\">\n    <h5 style=\"color: #facc15;\">3. MVVM</h5>\n    <pre style=\"background:#111; color:#ccc; padding:1rem; border-radius:6px; font-size:0.8rem;\">\n// ViewModel\nval text = MutableLiveData<String>()\nfun onButtonClick() {\n    text.value = \"Hola Mundo\" // Emite estado\n}\n\n// Activity\nviewModel.text.observe(this) { newText ->\n    textView.text = newText // Reacciona al cambio\n}\n    </pre>\n</div>\n\n<div style=\"margin-top: 2rem;\">\n    <h5 style=\"color: #f472b6;\">4. MVI</h5>\n    <pre style=\"background:#111; color:#ccc; padding:1rem; border-radius:6px; font-size:0.8rem;\">\n// Intent\ndata class UserClickedButton(val time: Long) : Intent\n\n// Reducer\nfun reduce(state: State, intent: Intent): State {\n    return when(intent) {\n        is UserClickedButton -> state.copy(text = \"Hola Mundo\")\n    }\n}\n    </pre>\n</div>"
                },
                {
                    "title": "8.4 Matriz de Decisión",
                    "content": "\n<h4 style=\"color: var(--accent-blue); margin-bottom: 1rem;\">Matriz de Decisión Estratégica</h4>\n<p>Utiliza esta guía rápida para tomar decisiones arquitectónicas basadas en las características de tu equipo y proyecto:</p>\n<ul style=\"list-style: none; padding: 0;\">\n    <li style=\"margin-bottom: 1rem; padding: 1rem; background: rgba(255,255,255,0.03); border-radius: 6px;\">\n        <strong style=\"color: var(--accent-purple);\">¿El equipo es Junior o tiene poca experiencia móvil?</strong>\n        <br><span style=\"color: #aaa;\"> Evita Clean Architecture y MVI. Empieza con MVVM estándar usando las guías oficiales de Google/Apple.</span>\n    </li>\n    <li style=\"margin-bottom: 1rem; padding: 1rem; background: rgba(255,255,255,0.03); border-radius: 6px;\">\n        <strong style=\"color: var(--accent-purple);\">¿La App tiene flujos de UI muy complejos (wizards, validaciones múltiples)?</strong>\n        <br><span style=\"color: #aaa;\"> MVI es tu mejor amigo. La máquina de estados simplifica drásticamente la gestión de lógica visual compleja.</span>\n    </li>\n    <li style=\"margin-bottom: 1rem; padding: 1rem; background: rgba(255,255,255,0.03); border-radius: 6px;\">\n        <strong style=\"color: var(--accent-purple);\">¿Es un proyecto a largo plazo (+3 años) con múltiples equipos?</strong>\n        <br><span style=\"color: #aaa;\"> Clean Architecture es obligatoria. Necesitas modularización para evitar que los equipos se pisen el código.</span>\n    </li>\n    <li style=\"margin-bottom: 1rem; padding: 1rem; background: rgba(255,255,255,0.03); border-radius: 6px;\">\n        <strong style=\"color: var(--accent-purple);\">¿Necesitas compartir lógica con Web o Backend?</strong>\n        <br><span style=\"color: #aaa;\"> Considera Kotlin Multiplatform (KMP) con Clean Architecture. La capa de Dominio puede ser compartida al 100%.</span>\n    </li>\n</ul>"
                },
                {
                    "title": "8.5 Puntos Clave de cada Modelo",
                    "content": "\n<h4 style=\"color: var(--accent-blue); margin-bottom: 1rem;\">Puntos Clave Resumidos</h4>\n<ul style=\"margin-left: 20px; color: #ccc; margin-bottom: 2rem; line-height: 1.8;\">\n    <li><strong>MVC:</strong> <em>Separación básica.</em> Ideal para empezar, pero peligroso si crece.</li>\n    <li><strong>MVP:</strong> <em>Testabilidad imperativa.</em> Mucho código, pero muy robusto para pruebas.</li>\n    <li><strong>MVVM:</strong> <em>Reactividad moderna.</em> El estándar actual de la industria. Menos código gracias al Data Binding.</li>\n    <li><strong>MVI:</strong> <em>Flujo Unidireccional.</em> Lo mejor para consistencia de estado y debugging. Complejo de aprender.</li>\n    <li><strong>Clean Architecture:</strong> <em>Independencia.</em> La estrategia a largo plazo. Protege tu negocio de los cambios tecnológicos.</li>\n</ul>\n<p style=\"text-align: center; font-style: italic; color: #888;\">\"No existe la bala de plata. La mejor arquitectura es la que mejor se adapta a los problemas de TU proyecto.\"</p>"
                },
                {
                    "title": "8.6 Tabla Comparativa",
                    "content": "\n<div class=\"table-responsive\" style=\"overflow-x: auto; margin-bottom: 2rem; border-radius: 8px; border: 1px solid #333;\">\n    <table style=\"width: 100%; border-collapse: collapse; min-width: 800px; font-size: 0.95rem;\">\n        <thead>\n            <tr style=\"background: linear-gradient(90deg, var(--accent-blue), var(--accent-purple)); color: white;\">\n                <th style=\"padding: 15px;\">Arquitectura</th>\n                <th style=\"padding: 15px;\"> Mejor Uso</th>\n                <th style=\"padding: 15px;\"> Peor Uso</th>\n                <th style=\"padding: 15px;\">Palabra Clave</th>\n            </tr>\n        </thead>\n        <tbody>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">MVC</td>\n                <td style=\"padding: 15px;\">Prototipos, Apps Académicas</td>\n                <td style=\"padding: 15px;\">Apps Enterprise, Equipos Grandes</td>\n                <td style=\"padding: 15px;\"><em>Simplicidad</em></td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">MVP</td>\n                <td style=\"padding: 15px;\">Apps medianas con UI compleja</td>\n                <td style=\"padding: 15px;\">Frameworks Declarativos (Compose/SwiftUI)</td>\n                <td style=\"padding: 15px;\"><em>Control</em></td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">MVVM</td>\n                <td style=\"padding: 15px;\">Estándar de Industria, Apps Modernas</td>\n                <td style=\"padding: 15px;\">Juegos, Apps triviales</td>\n                <td style=\"padding: 15px;\"><em>Reactividad</em></td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333; background: rgba(255,255,255,0.02);\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">MVI</td>\n                <td style=\"padding: 15px;\">Alta concurrencia, Debugging crítico</td>\n                <td style=\"padding: 15px;\">Equipos Junior, Proyectos cortos</td>\n                <td style=\"padding: 15px;\"><em>Previsibilidad</em></td>\n            </tr>\n            <tr style=\"border-bottom: 1px solid #333;\">\n                <td style=\"padding: 15px; font-weight: bold; color: var(--accent-blue);\">Clean Arch</td>\n                <td style=\"padding: 15px;\">Proyectos de +5 años, Multi-módulo</td>\n                <td style=\"padding: 15px;\">Startups MVP</td>\n                <td style=\"padding: 15px;\"><em>Independencia</em></td>\n            </tr>\n        </tbody>\n    </table>\n</div>"
                }
            ]
        },
        {
            "id": "9",
            "title": "Evaluación de Conocimientos",
            "description": "Cuestionario interactivo final para validar los conocimientos adquiridos.",
            "subtopics": [
                {
                    "title": "9.1 Cuestionario Final",
                    "content": "\n<div id=\"quiz-container\" style=\"max-width: 800px; margin: 0 auto;\">\n    <div class=\"quiz-header\" style=\"text-align: center; margin-bottom: 2rem;\">\n        <h3 style=\"color: var(--accent-blue);\"> Desafío de Arquitectura</h3>\n        <p>Selecciona las respuestas correctas y envía el formulario al final.</p>\n    </div>\n    <div id=\"loading-quiz\" style=\"text-align: center; padding: 2rem;\">\n        <p>Cargando preguntas...</p>\n    </div>\n    <form id=\"quiz-form\" style=\"display: none;\">\n        <!-- Questions injected here -->\n        <div style=\"text-align: center; margin-top: 3rem; margin-bottom: 3rem;\">\n            <button type=\"button\" id=\"btn-submit\" style=\"\n                padding: 15px 40px; \n                font-size: 1.2rem; \n                background: linear-gradient(45deg, var(--accent-blue), var(--accent-purple)); \n                color: white; \n                border: none; \n                border-radius: 50px; \n                cursor: pointer; \n                font-weight: bold;\n                box-shadow: 0 4px 15px rgba(0,0,0,0.5);\n                transition: transform 0.2s;\n            \">Enviar Respuestas</button>\n        </div>\n    </form>\n    \n    <div id=\"quiz-results\" style=\"display: none; padding: 2rem; background: #1a1a1a; border-radius: 10px; border: 1px solid #333;\">\n        <div style=\"text-align: center; margin-bottom: 2rem;\">\n            <h2 style=\"color: #fff;\">Resultados</h2>\n            <div style=\"font-size: 2rem; font-weight: bold; color: var(--accent-blue); margin: 1rem 0;\">\n                <span id=\"final-score\">0</span> / <span id=\"total-qs\">0</span>\n            </div>\n            <p id=\"score-message\" style=\"color: #ccc;\"></p>\n        </div>\n        \n        <div id=\"results-details\"></div>\n\n        <div style=\"text-align: center; margin-top: 3rem;\">\n            <a href=\"index.html\" style=\"\n                padding: 12px 30px; \n                background: #333; \n                color: white; \n                text-decoration: none; \n                border-radius: 5px;\n                font-weight: bold;\n            \">Volver al Inicio</a>\n            <button onclick=\"location.reload()\" style=\"\n                margin-left: 1rem;\n                padding: 12px 30px; \n                background: var(--accent-purple); \n                color: white; \n                border: none; \n                border-radius: 5px; \n                cursor: pointer; \n                font-weight: bold;\n            \">Intentar de nuevo</button>\n        </div>\n    </div>\n</div>\n<script>\n    let quizData = [];\n    \n    document.addEventListener(\"DOMContentLoaded\", function() {\n        fetch(\"api_get_quiz.php\")\n            .then(response => response.json())\n            .then(questions => {\n                quizData = questions;\n                const form = document.getElementById(\"quiz-form\");\n                const loading = document.getElementById(\"loading-quiz\");\n                \n                loading.style.display = \"none\";\n                form.style.display = \"block\";\n\n                questions.forEach((q, index) => {\n                    const qDiv = document.createElement(\"div\");\n                    qDiv.className = \"quiz-question card\";\n                    qDiv.style.marginBottom = \"2rem\";\n                    qDiv.style.padding = \"1.5rem\";\n                    qDiv.innerHTML = `\n                        <h4 style=\"margin-bottom: 1rem; color: #fff;\">${index + 1}. ${q.question_text}</h4>\n                        <div class=\"options-grid\" style=\"display: grid; gap: 10px;\">\n                            <label class=\"quiz-option\" style=\"display: block; padding: 10px; background: rgba(255,255,255,0.05); border-radius: 5px; cursor: pointer;\">\n                                <input type=\"radio\" name=\"q${q.id}\" value=\"A\"> ${q.option_a}\n                            </label>\n                            <label class=\"quiz-option\" style=\"display: block; padding: 10px; background: rgba(255,255,255,0.05); border-radius: 5px; cursor: pointer;\">\n                                <input type=\"radio\" name=\"q${q.id}\" value=\"B\"> ${q.option_b}\n                            </label>\n                            <label class=\"quiz-option\" style=\"display: block; padding: 10px; background: rgba(255,255,255,0.05); border-radius: 5px; cursor: pointer;\">\n                                <input type=\"radio\" name=\"q${q.id}\" value=\"C\"> ${q.option_c}\n                            </label>\n                            <label class=\"quiz-option\" style=\"display: block; padding: 10px; background: rgba(255,255,255,0.05); border-radius: 5px; cursor: pointer;\">\n                                <input type=\"radio\" name=\"q${q.id}\" value=\"D\"> ${q.option_d}\n                            </label>\n                        </div>\n                    `;\n                    // Insert before the submit button container\n                    form.insertBefore(qDiv, form.lastElementChild);\n                });\n\n                document.getElementById(\"btn-submit\").addEventListener(\"click\", calculateResults);\n            })\n            .catch(err => {\n                console.error(\"Error loading quiz:\", err);\n                document.getElementById(\"loading-quiz\").innerHTML = \"<p style='color: red;'>Error al cargar el cuestionario.</p>\";\n            });\n    });\n\n    function calculateResults() {\n        let score = 0;\n        const resultsDiv = document.getElementById(\"results-details\");\n        resultsDiv.innerHTML = \"\";\n        \n        let allAnswered = true;\n\n        quizData.forEach(q => {\n            const selected = document.querySelector(`input[name=\"q${q.id}\"]:checked`);\n            if (!selected) {\n                // allAnswered = false; // Optional: force answer all\n            }\n        });\n\n        // Calculate and build details\n        quizData.forEach((q, index) => {\n            const selected = document.querySelector(`input[name=\"q${q.id}\"]:checked`);\n            const userVal = selected ? selected.value : null;\n            const isCorrect = userVal === q.correct_option;\n            \n            if (isCorrect) score++;\n\n            // Pick random tip\n            let tips = [];\n            try {\n                tips = JSON.parse(q.tips);\n            } catch(e) { tips = [\"Consejo no disponible.\"]; }\n            const randomTip = tips[Math.floor(Math.random() * tips.length)];\n\n            const resultItem = document.createElement(\"div\");\n            resultItem.style.marginBottom = \"2rem\";\n            resultItem.style.padding = \"1rem\";\n            resultItem.style.borderLeft = isCorrect ? \"4px solid #4ade80\" : \"4px solid #f87171\";\n            resultItem.style.background = \"rgba(255,255,255,0.02)\";\n            resultItem.style.borderRadius = \"4px\";\n\n            let statusHtml = isCorrect \n                ? `<span style=\"color: #4ade80; font-weight: bold;\"> Correcto</span>` \n                : `<span style=\"color: #f87171; font-weight: bold;\"> Incorrecto (Tu respuesta: ${userVal || \"Ninguna\"})</span>`;\n            \n            let correctAnswerHtml = !isCorrect \n                ? `<p style=\"color: #ccc; margin-top: 0.5rem;\">La respuesta correcta era: <strong>${q.correct_option}</strong></p>` \n                : \"\";\n\n            resultItem.innerHTML = `\n                <h4 style=\"color: #fff; margin-bottom: 0.5rem;\">${index + 1}. ${q.question_text}</h4>\n                ${statusHtml}\n                ${correctAnswerHtml}\n                <div style=\"margin-top: 1rem; padding-top: 1rem; border-top: 1px solid #333;\">\n                    <p style=\"color: #aaa; font-style: italic; font-size: 0.9rem;\"> <strong>Tip de Aprendizaje:</strong> ${randomTip}</p>\n                </div>\n            `;\n            resultsDiv.appendChild(resultItem);\n        });\n\n        // Update UI\n        document.getElementById(\"quiz-form\").style.display = \"none\";\n        document.getElementById(\"quiz-results\").style.display = \"block\";\n        document.getElementById(\"final-score\").textContent = score;\n        document.getElementById(\"total-qs\").textContent = quizData.length;\n        \n        const percentage = (score / quizData.length) * 100;\n        const msg = document.getElementById(\"score-message\");\n        if (percentage === 100) msg.textContent = \"¡Excelente! Eres un experto en arquitecturas.\";\n        else if (percentage >= 80) msg.textContent = \"¡Muy bien! Tienes conocimientos sólidos.\";\n        else if (percentage >= 50) msg.textContent = \"Buen intento, pero repasa los temas clave.\";\n        else msg.textContent = \"Te recomendamos leer nuevamente las secciones de aprendizaje.\";\n        \n        window.scrollTo(0, 0);\n    }\n</script>"
                }
            ]
        }
    ],
    "quiz": [
        {
            "id": "1",
            "question_text": "¿Cuál es el objetivo principal de una arquitectura de software móvil?",
            "option_a": "Hacer que la app se vea bonita",
            "option_b": "Estructurar el sistema para facilitar mantenimiento y escalabilidad",
            "option_c": "Escribir menos código",
            "option_d": "Usar la última tecnología disponible",
            "correct_option": "B",
            "explanation": "La arquitectura busca organizar el código para que sea mantenible, escalable y testable a largo plazo.",
            "tips": "[\"Una buena arquitectura reduce la deuda t\\u00e9cnica a largo plazo.\",\"La estructura debe ser independiente de las librer\\u00edas que usas.\",\"Piensa en la arquitectura como los cimientos de un edificio.\"]"
        },
        {
            "id": "2",
            "question_text": "En el patrón MVC, ¿qué componente es responsable de la lógica de negocio y los datos?",
            "option_a": "Vista (View)",
            "option_b": "Controlador (Controller)",
            "option_c": "Modelo (Model)",
            "option_d": "Usuario",
            "correct_option": "C",
            "explanation": "El Modelo encapsula la lógica de negocio y el estado de la aplicación, independiente de la interfaz.",
            "tips": "[\"El Modelo nunca debe importar clases de la Vista (ej: android.view.*).\",\"La l\\u00f3gica de negocio debe ser pura y f\\u00e1cil de probar.\",\"El Modelo es la \\\"verdad\\\" de tu aplicaci\\u00f3n.\"]"
        },
        {
            "id": "3",
            "question_text": "¿Cuál es una desventaja común del patrón MVC en aplicaciones complejas?",
            "option_a": "Es demasiado difícil de aprender",
            "option_b": "El Controlador tiende a volverse masivo (Massive View Controller)",
            "option_c": "No permite usar bases de datos",
            "option_d": "La Vista no se puede actualizar",
            "correct_option": "B",
            "explanation": "En apps grandes, el Controlador asume demasiadas responsabilidades, volviéndose difícil de mantener.",
            "tips": "[\"Divide y vencer\\u00e1s: si una clase tiene 1000 l\\u00edneas, algo anda mal.\",\"MVC es excelente para prototipos, pero cuidado al escalar.\",\"El \\\"Massive View Controller\\\" es el anti-patr\\u00f3n m\\u00e1s com\\u00fan en iOS\\/Android cl\\u00e1sico.\"]"
        },
        {
            "id": "4",
            "question_text": "En MVP, ¿cómo se comunican la Vista y el Presentador?",
            "option_a": "Directamente accediendo a variables",
            "option_b": "A través de interfaces (Contratos)",
            "option_c": "Mediante eventos del sistema operativo",
            "option_d": "No se comunican",
            "correct_option": "B",
            "explanation": "MVP usa interfaces para desacoplar la Vista del Presentador, facilitando el testing.",
            "tips": "[\"Las interfaces permiten \\\"mentirle\\\" al Presentador durante los tests (Mocking).\",\"El Presentador no debe saber si est\\u00e1 en un celular o en una tablet.\",\"Humble View: mant\\u00e9n tu vista lo m\\u00e1s tonta posible.\"]"
        },
        {
            "id": "5",
            "question_text": "¿Qué ventaja principal ofrece MVP sobre MVC para el testing?",
            "option_a": "No requiere escribir tests",
            "option_b": "Permite probar la lógica de presentación sin depender de la UI (Android/iOS)",
            "option_c": "Es más rápido de compilar",
            "option_d": "Usa menos memoria",
            "correct_option": "B",
            "explanation": "Al aislar la lógica en el Presentador (POJO), se pueden correr tests unitarios sin emuladores.",
            "tips": "[\"Los tests unitarios son cientos de veces m\\u00e1s r\\u00e1pidos que los de UI.\",\"Si puedes probar tu l\\u00f3gica en segundos, la probar\\u00e1s m\\u00e1s seguido.\",\"La inyecci\\u00f3n de dependencias es clave para un buen testing.\"]"
        },
        {
            "id": "6",
            "question_text": "¿Qué componente es clave en MVVM para conectar la Vista y el ViewModel?",
            "option_a": "El Controlador",
            "option_b": "Data Binding u Observables",
            "option_c": "Un archivo XML estático",
            "option_d": "Una base de datos SQL",
            "correct_option": "B",
            "explanation": "El Data Binding o los patrones de observación (LiveData, StateFlow) permiten que la Vista reaccione automáticamente a cambios en el ViewModel.",
            "tips": "[\"Observar datos es mejor que pedir datos.\",\"El patr\\u00f3n Observer desacopla el productor del consumidor.\",\"MVVM brilla cuando usas frameworks reactivos como RxJava o Flow.\"]"
        },
        {
            "id": "7",
            "question_text": "¿Cuál es el rol del ViewModel en MVVM?",
            "option_a": "Dibujar los botones en pantalla",
            "option_b": "Guardar datos en el disco duro",
            "option_c": "Exponer el estado y manejar la lógica de presentación para la Vista",
            "option_d": "Validar transacciones bancarias",
            "correct_option": "C",
            "explanation": "El ViewModel transforma los datos del Modelo para que la Vista los consuma y maneja el estado de la UI.",
            "tips": "[\"El ViewModel debe sobrevivir a la rotaci\\u00f3n de pantalla.\",\"Nunca pases referencias de View al ViewModel (Memory Leak).\",\"El ViewModel transforma datos crudos en datos visualizables.\"]"
        },
        {
            "id": "8",
            "question_text": "¿Qué característica define al flujo de datos en MVI?",
            "option_a": "Es bidireccional y caótico",
            "option_b": "Es unidireccional y cíclico (Intent -> Model -> View)",
            "option_c": "No hay flujo de datos",
            "option_d": "Depende del usuario",
            "correct_option": "B",
            "explanation": "MVI impone un flujo estricto unidireccional donde los Intents generan nuevos estados inmutables.",
            "tips": "[\"El flujo unidireccional hace que los errores sean f\\u00e1ciles de rastrear.\",\"MVI es como Redux pero para m\\u00f3viles.\",\"La previsibilidad es la mayor ventaja de MVI.\"]"
        },
        {
            "id": "9",
            "question_text": "En MVI, el estado de la aplicación es...",
            "option_a": "Mutable y distribuido",
            "option_b": "Inmutable y centralizado",
            "option_c": "Opcional",
            "option_d": "Guardado solo en la nube",
            "correct_option": "B",
            "explanation": "MVI trata el estado como inmutable; cada cambio genera una nueva instancia del estado completo.",
            "tips": "[\"La inmutabilidad previene condiciones de carrera (Race Conditions).\",\"Con estados inmutables puedes hacer \\\"Time Travel Debugging\\\".\",\"El estado debe representar TODO lo que se ve en pantalla.\"]"
        },
        {
            "id": "10",
            "question_text": "Según Clean Architecture, ¿hacia dónde deben apuntar las dependencias?",
            "option_a": "Hacia afuera (Frameworks)",
            "option_b": "Hacia adentro (Reglas de Negocio/Dominio)",
            "option_c": "Hacia la base de datos",
            "option_d": "Aleatoriamente",
            "correct_option": "B",
            "explanation": "La Regla de Dependencia establece que las capas externas dependen de las internas, nunca al revés.",
            "tips": "[\"El dominio es el rey, la base de datos es un detalle.\",\"Protege tu l\\u00f3gica de negocio de los cambios en frameworks.\",\"Las capas internas son las m\\u00e1s estables.\"]"
        },
        {
            "id": "11",
            "question_text": "¿Qué capa se encuentra en el centro de Clean Architecture?",
            "option_a": "Presentadores",
            "option_b": "Base de Datos",
            "option_c": "Entidades (Entities)",
            "option_d": "Interfaz de Usuario",
            "correct_option": "C",
            "explanation": "Las Entidades encapsulan las reglas de negocio más generales y de alto nivel.",
            "tips": "[\"Las entidades no deben tener dependencias de nada externo.\",\"Son los objetos de negocio puros de tu aplicaci\\u00f3n.\",\"Si cambia la UI, las entidades no deber\\u00edan enterarse.\"]"
        },
        {
            "id": "12",
            "question_text": "¿Cómo logra Clean Architecture que un Caso de Uso obtenga datos de una Base de Datos externa sin depender de ella?",
            "option_a": "Usando SQL directo en el Caso de Uso",
            "option_b": "Mediante Inversión de Dependencias (Interfaces)",
            "option_c": "No es posible",
            "option_d": "Usando variables globales",
            "correct_option": "B",
            "explanation": "Se definen interfaces en la capa interna que son implementadas por la capa externa (Inversión de Control).",
            "tips": "[\"El Caso de Uso define QU\\u00c9 necesita, la capa externa define C\\u00d3MO obtenerlo.\",\"Esto permite cambiar de Room a Realm sin tocar el Caso de Uso.\",\"La dependencia en tiempo de compilaci\\u00f3n apunta hacia adentro, en ejecuci\\u00f3n se inyecta la implementaci\\u00f3n.\"]"
        },
        {
            "id": "13",
            "question_text": "En una arquitectura por capas típica, la capa de presentación debe comunicarse directamente con...",
            "option_a": "La base de datos",
            "option_b": "La capa de lógica de negocio",
            "option_c": "La capa de infraestructura",
            "option_d": "Servicios externos",
            "correct_option": "B",
            "explanation": "Para mantener la separación, la presentación habla con la lógica, y esta con los datos.",
            "tips": "[\"Saltar capas crea \\\"Spaghetti Code\\\".\",\"Respeta la jerarqu\\u00eda para mantener el orden.\",\"Cada capa debe tener una responsabilidad \\u00fanica.\"]"
        },
        {
            "id": "14",
            "question_text": "Si tienes un equipo junior y necesitas un prototipo rápido para mañana, ¿qué arquitectura elegirías?",
            "option_a": "Clean Architecture",
            "option_b": "MVI",
            "option_c": "MVC",
            "option_d": "Microservicios",
            "correct_option": "C",
            "explanation": "MVC es la más simple y rápida de implementar para proyectos pequeños o prototipos.",
            "tips": "[\"No mates moscas a ca\\u00f1onazos: usa la herramienta adecuada.\",\"La complejidad innecesaria es el enemigo del desarrollo r\\u00e1pido.\",\"Siempre puedes refactorizar despu\\u00e9s (si sobrevives).\"]"
        },
        {
            "id": "15",
            "question_text": "¿Qué arquitectura es ideal para una app bancaria que requiere alta trazabilidad y cero errores de estado?",
            "option_a": "MVC",
            "option_b": "MVP",
            "option_c": "MVI",
            "option_d": "No importa",
            "correct_option": "C",
            "explanation": "MVI ofrece un control de estado predecible y unidireccional, ideal para apps críticas y complejas.",
            "tips": "[\"En finanzas, la consistencia de datos es m\\u00e1s importante que la velocidad de desarrollo.\",\"MVI previene estados imposibles en la UI.\",\"La trazabilidad de MVI facilita las auditor\\u00edas de c\\u00f3digo.\"]"
        }
    ]
}